Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP512GM304.h
#define _RPINR16_QEA2R_POSITION                  0x00000000
#define _RPINR16_QEA2R_MASK                      0x0000007F
#define _RPINR16_QEA2R_LENGTH                    0x00000007

#define _RPINR16_QEB2R_POSITION                  0x00000008
#define _RPINR16_QEB2R_MASK                      0x00007F00
#define _RPINR16_QEB2R_LENGTH                    0x00000007

#define _RPINR16_QEA2R0_POSITION                 0x00000000
#define _RPINR16_QEA2R0_MASK                     0x00000001
#define _RPINR16_QEA2R0_LENGTH                   0x00000001

#define _RPINR16_QEA2R1_POSITION                 0x00000001
#define _RPINR16_QEA2R1_MASK                     0x00000002
#define _RPINR16_QEA2R1_LENGTH                   0x00000001

#define _RPINR16_QEA2R2_POSITION                 0x00000002
#define _RPINR16_QEA2R2_MASK                     0x00000004
#define _RPINR16_QEA2R2_LENGTH                   0x00000001

#define _RPINR16_QEA2R3_POSITION                 0x00000003
#define _RPINR16_QEA2R3_MASK                     0x00000008
#define _RPINR16_QEA2R3_LENGTH                   0x00000001

#define _RPINR16_QEA2R4_POSITION                 0x00000004
#define _RPINR16_QEA2R4_MASK                     0x00000010
#define _RPINR16_QEA2R4_LENGTH                   0x00000001

#define _RPINR16_QEA2R5_POSITION                 0x00000005
#define _RPINR16_QEA2R5_MASK                     0x00000020
#define _RPINR16_QEA2R5_LENGTH                   0x00000001

#define _RPINR16_QEA2R6_POSITION                 0x00000006
#define _RPINR16_QEA2R6_MASK                     0x00000040
#define _RPINR16_QEA2R6_LENGTH                   0x00000001

#define _RPINR16_QEB2R0_POSITION                 0x00000008
#define _RPINR16_QEB2R0_MASK                     0x00000100
#define _RPINR16_QEB2R0_LENGTH                   0x00000001

#define _RPINR16_QEB2R1_POSITION                 0x00000009
#define _RPINR16_QEB2R1_MASK                     0x00000200
#define _RPINR16_QEB2R1_LENGTH                   0x00000001

#define _RPINR16_QEB2R2_POSITION                 0x0000000A
#define _RPINR16_QEB2R2_MASK                     0x00000400
#define _RPINR16_QEB2R2_LENGTH                   0x00000001

#define _RPINR16_QEB2R3_POSITION                 0x0000000B
#define _RPINR16_QEB2R3_MASK                     0x00000800
#define _RPINR16_QEB2R3_LENGTH                   0x00000001

#define _RPINR16_QEB2R4_POSITION                 0x0000000C
#define _RPINR16_QEB2R4_MASK                     0x00001000
#define _RPINR16_QEB2R4_LENGTH                   0x00000001

#define _RPINR16_QEB2R5_POSITION                 0x0000000D
#define _RPINR16_QEB2R5_MASK                     0x00002000
#define _RPINR16_QEB2R5_LENGTH                   0x00000001

#define _RPINR16_QEB2R6_POSITION                 0x0000000E
#define _RPINR16_QEB2R6_MASK                     0x00004000
#define _RPINR16_QEB2R6_LENGTH                   0x00000001

#define _RPINR17_INDX2R_POSITION                 0x00000000
#define _RPINR17_INDX2R_MASK                     0x0000007F
#define _RPINR17_INDX2R_LENGTH                   0x00000007

#define _RPINR17_HOME2R_POSITION                 0x00000008
#define _RPINR17_HOME2R_MASK                     0x00007F00
#define _RPINR17_HOME2R_LENGTH                   0x00000007

#define _RPINR17_INDX2R0_POSITION                0x00000000
#define _RPINR17_INDX2R0_MASK                    0x00000001
#define _RPINR17_INDX2R0_LENGTH                  0x00000001

#define _RPINR17_INDX2R1_POSITION                0x00000001
#define _RPINR17_INDX2R1_MASK                    0x00000002
#define _RPINR17_INDX2R1_LENGTH                  0x00000001

#define _RPINR17_INDX2R2_POSITION                0x00000002
#define _RPINR17_INDX2R2_MASK                    0x00000004
#define _RPINR17_INDX2R2_LENGTH                  0x00000001

#define _RPINR17_INDX2R3_POSITION                0x00000003
#define _RPINR17_INDX2R3_MASK                    0x00000008
#define _RPINR17_INDX2R3_LENGTH                  0x00000001

#define _RPINR17_INDX2R4_POSITION                0x00000004
#define _RPINR17_INDX2R4_MASK                    0x00000010
#define _RPINR17_INDX2R4_LENGTH                  0x00000001

#define _RPINR17_INDX2R5_POSITION                0x00000005
#define _RPINR17_INDX2R5_MASK                    0x00000020
#define _RPINR17_INDX2R5_LENGTH                  0x00000001

#define _RPINR17_INDX2R6_POSITION                0x00000006
#define _RPINR17_INDX2R6_MASK                    0x00000040
#define _RPINR17_INDX2R6_LENGTH                  0x00000001

#define _RPINR17_HOME2R0_POSITION                0x00000008
#define _RPINR17_HOME2R0_MASK                    0x00000100
#define _RPINR17_HOME2R0_LENGTH                  0x00000001

#define _RPINR17_HOME2R1_POSITION                0x00000009
#define _RPINR17_HOME2R1_MASK                    0x00000200
#define _RPINR17_HOME2R1_LENGTH                  0x00000001

#define _RPINR17_HOME2R2_POSITION                0x0000000A
#define _RPINR17_HOME2R2_MASK                    0x00000400
#define _RPINR17_HOME2R2_LENGTH                  0x00000001

#define _RPINR17_HOME2R3_POSITION                0x0000000B
#define _RPINR17_HOME2R3_MASK                    0x00000800
#define _RPINR17_HOME2R3_LENGTH                  0x00000001

#define _RPINR17_HOME2R4_POSITION                0x0000000C
#define _RPINR17_HOME2R4_MASK                    0x00001000
#define _RPINR17_HOME2R4_LENGTH                  0x00000001

#define _RPINR17_HOME2R5_POSITION                0x0000000D
#define _RPINR17_HOME2R5_MASK                    0x00002000
#define _RPINR17_HOME2R5_LENGTH                  0x00000001

#define _RPINR17_HOME2R6_POSITION                0x0000000E
#define _RPINR17_HOME2R6_MASK                    0x00004000
#define _RPINR17_HOME2R6_LENGTH                  0x00000001

#define _RPINR18_U1RXR_POSITION                  0x00000000
#define _RPINR18_U1RXR_MASK                      0x0000007F
#define _RPINR18_U1RXR_LENGTH                    0x00000007

#define _RPINR18_U1RXR0_POSITION                 0x00000000
#define _RPINR18_U1RXR0_MASK                     0x00000001
#define _RPINR18_U1RXR0_LENGTH                   0x00000001

#define _RPINR18_U1RXR1_POSITION                 0x00000001
#define _RPINR18_U1RXR1_MASK                     0x00000002
#define _RPINR18_U1RXR1_LENGTH                   0x00000001

