Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP512GM304.h
#define _RPINR39_DTCMP3R3_POSITION               0x0000000B
#define _RPINR39_DTCMP3R3_MASK                   0x00000800
#define _RPINR39_DTCMP3R3_LENGTH                 0x00000001

#define _RPINR39_DTCMP3R4_POSITION               0x0000000C
#define _RPINR39_DTCMP3R4_MASK                   0x00001000
#define _RPINR39_DTCMP3R4_LENGTH                 0x00000001

#define _RPINR39_DTCMP3R5_POSITION               0x0000000D
#define _RPINR39_DTCMP3R5_MASK                   0x00002000
#define _RPINR39_DTCMP3R5_LENGTH                 0x00000001

#define _RPINR39_DTCMP3R6_POSITION               0x0000000E
#define _RPINR39_DTCMP3R6_MASK                   0x00004000
#define _RPINR39_DTCMP3R6_LENGTH                 0x00000001

#define _RPINR40_DTCMP4R_POSITION                0x00000000
#define _RPINR40_DTCMP4R_MASK                    0x0000007F
#define _RPINR40_DTCMP4R_LENGTH                  0x00000007

#define _RPINR40_DTCMP5R_POSITION                0x00000008
#define _RPINR40_DTCMP5R_MASK                    0x00007F00
#define _RPINR40_DTCMP5R_LENGTH                  0x00000007

#define _RPINR40_DTCMP4R0_POSITION               0x00000000
#define _RPINR40_DTCMP4R0_MASK                   0x00000001
#define _RPINR40_DTCMP4R0_LENGTH                 0x00000001

#define _RPINR40_DTCMP4R1_POSITION               0x00000001
#define _RPINR40_DTCMP4R1_MASK                   0x00000002
#define _RPINR40_DTCMP4R1_LENGTH                 0x00000001

#define _RPINR40_DTCMP4R2_POSITION               0x00000002
#define _RPINR40_DTCMP4R2_MASK                   0x00000004
#define _RPINR40_DTCMP4R2_LENGTH                 0x00000001

#define _RPINR40_DTCMP4R3_POSITION               0x00000003
#define _RPINR40_DTCMP4R3_MASK                   0x00000008
#define _RPINR40_DTCMP4R3_LENGTH                 0x00000001

#define _RPINR40_DTCMP4R4_POSITION               0x00000004
#define _RPINR40_DTCMP4R4_MASK                   0x00000010
#define _RPINR40_DTCMP4R4_LENGTH                 0x00000001

#define _RPINR40_DTCMP4R5_POSITION               0x00000005
#define _RPINR40_DTCMP4R5_MASK                   0x00000020
#define _RPINR40_DTCMP4R5_LENGTH                 0x00000001

#define _RPINR40_DTCMP4R6_POSITION               0x00000006
#define _RPINR40_DTCMP4R6_MASK                   0x00000040
#define _RPINR40_DTCMP4R6_LENGTH                 0x00000001

#define _RPINR40_DTCMP5R0_POSITION               0x00000008
#define _RPINR40_DTCMP5R0_MASK                   0x00000100
#define _RPINR40_DTCMP5R0_LENGTH                 0x00000001

#define _RPINR40_DTCMP5R1_POSITION               0x00000009
#define _RPINR40_DTCMP5R1_MASK                   0x00000200
#define _RPINR40_DTCMP5R1_LENGTH                 0x00000001

#define _RPINR40_DTCMP5R2_POSITION               0x0000000A
#define _RPINR40_DTCMP5R2_MASK                   0x00000400
#define _RPINR40_DTCMP5R2_LENGTH                 0x00000001

#define _RPINR40_DTCMP5R3_POSITION               0x0000000B
#define _RPINR40_DTCMP5R3_MASK                   0x00000800
#define _RPINR40_DTCMP5R3_LENGTH                 0x00000001

#define _RPINR40_DTCMP5R4_POSITION               0x0000000C
#define _RPINR40_DTCMP5R4_MASK                   0x00001000
#define _RPINR40_DTCMP5R4_LENGTH                 0x00000001

#define _RPINR40_DTCMP5R5_POSITION               0x0000000D
#define _RPINR40_DTCMP5R5_MASK                   0x00002000
#define _RPINR40_DTCMP5R5_LENGTH                 0x00000001

#define _RPINR40_DTCMP5R6_POSITION               0x0000000E
#define _RPINR40_DTCMP5R6_MASK                   0x00004000
#define _RPINR40_DTCMP5R6_LENGTH                 0x00000001

#define _RPINR41_DTCMP6R_POSITION                0x00000000
#define _RPINR41_DTCMP6R_MASK                    0x0000007F
#define _RPINR41_DTCMP6R_LENGTH                  0x00000007

#define _RPINR41_DTCMP6R0_POSITION               0x00000000
#define _RPINR41_DTCMP6R0_MASK                   0x00000001
#define _RPINR41_DTCMP6R0_LENGTH                 0x00000001

#define _RPINR41_DTCMP6R1_POSITION               0x00000001
#define _RPINR41_DTCMP6R1_MASK                   0x00000002
#define _RPINR41_DTCMP6R1_LENGTH                 0x00000001

#define _RPINR41_DTCMP6R2_POSITION               0x00000002
#define _RPINR41_DTCMP6R2_MASK                   0x00000004
#define _RPINR41_DTCMP6R2_LENGTH                 0x00000001

#define _RPINR41_DTCMP6R3_POSITION               0x00000003
#define _RPINR41_DTCMP6R3_MASK                   0x00000008
#define _RPINR41_DTCMP6R3_LENGTH                 0x00000001

#define _RPINR41_DTCMP6R4_POSITION               0x00000004
#define _RPINR41_DTCMP6R4_MASK                   0x00000010
#define _RPINR41_DTCMP6R4_LENGTH                 0x00000001

#define _RPINR41_DTCMP6R5_POSITION               0x00000005
#define _RPINR41_DTCMP6R5_MASK                   0x00000020
#define _RPINR41_DTCMP6R5_LENGTH                 0x00000001

#define _RPINR41_DTCMP6R6_POSITION               0x00000006
#define _RPINR41_DTCMP6R6_MASK                   0x00000040
#define _RPINR41_DTCMP6R6_LENGTH                 0x00000001

#define _NVMCON_NVMOP_POSITION                   0x00000000
#define _NVMCON_NVMOP_MASK                       0x0000000F
#define _NVMCON_NVMOP_LENGTH                     0x00000004

#define _NVMCON_URERR_POSITION                   0x00000008
#define _NVMCON_URERR_MASK                       0x00000100
#define _NVMCON_URERR_LENGTH                     0x00000001

#define _NVMCON_RPDF_POSITION                    0x00000009
#define _NVMCON_RPDF_MASK                        0x00000200
#define _NVMCON_RPDF_LENGTH                      0x00000001

#define _NVMCON_NVMSIDL_POSITION                 0x0000000C
#define _NVMCON_NVMSIDL_MASK                     0x00001000
#define _NVMCON_NVMSIDL_LENGTH                   0x00000001

#define _NVMCON_WRERR_POSITION                   0x0000000D
#define _NVMCON_WRERR_MASK                       0x00002000
#define _NVMCON_WRERR_LENGTH                     0x00000001

#define _NVMCON_WREN_POSITION                    0x0000000E
#define _NVMCON_WREN_MASK                        0x00004000
#define _NVMCON_WREN_LENGTH                      0x00000001

#define _NVMCON_WR_POSITION                      0x0000000F
#define _NVMCON_WR_MASK                          0x00008000
#define _NVMCON_WR_LENGTH                        0x00000001

#define _NVMCON_NVMOP0_POSITION                  0x00000000
#define _NVMCON_NVMOP0_MASK                      0x00000001
#define _NVMCON_NVMOP0_LENGTH                    0x00000001

#define _NVMCON_NVMOP1_POSITION                  0x00000001
#define _NVMCON_NVMOP1_MASK                      0x00000002
#define _NVMCON_NVMOP1_LENGTH                    0x00000001

#define _NVMCON_NVMOP2_POSITION                  0x00000002
#define _NVMCON_NVMOP2_MASK                      0x00000004
#define _NVMCON_NVMOP2_LENGTH                    0x00000001

#define _NVMCON_NVMOP3_POSITION                  0x00000003
#define _NVMCON_NVMOP3_MASK                      0x00000008
#define _NVMCON_NVMOP3_LENGTH                    0x00000001

#define _NVMADRU_NVMADRU_POSITION                0x00000000
#define _NVMADRU_NVMADRU_MASK                    0x000000FF
#define _NVMADRU_NVMADRU_LENGTH                  0x00000008

